[{"text": "I can't tell if this is a troll post or not. If it's not then you've paid a lot of money to learn one of the most important rules of investing. Never put all of your eggs in one basket, you must diversify!! What you did was the equivalent of going to Vegas and betting it all on black. And instead of taking your winnings you decided to double down and lost.\nThe good news is you're still really young and can still fire, its just gonna take longer. Just follow the principles and stay on the path and for the love of God diversify your portfolio", "author": "jcribbs91", "children": [{"text": "Username checks out 😏", "author": "Honeycombhome"}, {"text": "Ha. More like bet it all on 00. Now he's upset because every other bet of the same caliber is a loser. Of course it is!\nOnly one path forward now. Gotta do it the same way the rest of us are....slow and steady....", "author": "SizeWide"}, {"text": "4k and this travel experience is not an expensive lesson buddy", "author": "Hefty_Log_5402"}]}, {"text": "Wow. What a wild ride that must've been. But ya lessons learned.\nI gotta say though, you are sounding kinda entitled with the attitude you have towards wealth. You basically hit the lottery and went from nothing to allot. You're back at nothing again now. You aren't owed that wealth.\nYou got lucky the first time not having to work for it. This time you will need to work. Don't look for the next Luna coin.", "author": "ecdirtdevil", "children": [{"text": "I know, im not going back to crypto to make money this time i need to find new ways and just go forward with my life i guess with the right mindset it shouldn't be impossible", "author": "Deadontheinside18"}]}, {"text": "You gotta know when hold em’\nKnow when fold em’\nKnow when to walk away\nKnow when to run", "author": "goodguy847"}, {"text": "Well, if it makes you feel any better, I also had no money when I was 19 years old. Now 30 years later, I have the freedom to travel the world, and you can too.", "author": "WakeRider11", "children": [{"text": "Thanks for the words man, i for sure can i just need the right mindset and alot of time 😅", "author": "Deadontheinside18"}]}, {"text": "You didn’t “make any money” you gambled. Hit the lottery. Gambled again. Blew your winnings. That’s what gamblers do, have huge upswings and downswings. The same mentality that allows people to win huge also dooms them to lose huge.\nGo back to school, build a career again. $400k isn’t really that much to sustain a 19 year old for life. If you thought you were gonna get like 15% return risk free for the rest of your life, you were sorely mistaken. The stablecoin was a scam from the start and hopefully you recognize in the future it ain’t that easy.\nThat said you’re 19 dude. You’ll be fine with plenty of time to build wealth again. You don’t have to work the rest of your life, get a decent job, save and live frugally while you’re young, invest in wiser investments. Live off those investments.", "author": "_mdz"}, {"text": "You made nothing and lost nothing. It’s just a dream", "author": "Fit_Acanthisitta_475"}, {"text": "At USTC 0.01 you’re literally even on your investment\nWith that much in anchor you probably got an airdrop on the new chain too which would leave you up\nSo you didn’t even lose principle. You lost unprotected gains\nBuck up buttercup and get back to work\nSome people bought the top and actually lost everything. Dunno if they were ever confirmed but there were those couple reported suicides. You’re alive. Be grateful\nPre crash was a helluva time. Be glad you experienced that euphoria once in your life. Most people never will", "author": "CryptidHunter48", "children": [{"text": "I guess its true, and yes i got an airdrop of 4500 LUNA 2 that is vested (locked) until 2024 November.\nThanks for the cheers up 😄", "author": "Deadontheinside18", "children": [{"text": "Get to work making the airdrop as valuable as possible in your free time", "author": "CryptidHunter48"}]}]}, {"text": "All I can say is\nBruh", "author": "Bad_Adam1917"}, {"text": "I saw you posted on WSB. Yeah, a lot of us have been there: had it all and lost it. Get a job and then you can make your money back slowly.", "author": "Honeycombhome"}, {"text": "Reading this I only have one thing to suggest. Go back to school.", "author": "Whalesongsblow"}, {"text": "Lmao gg u get what you sow. Enjoy the expensive life lesson and get a job", "author": "throwaway3310221", "children": [{"text": "cruel.", "author": "Junior_Edge9203"}]}, {"text": "Lesson learned- diversification is good. Next time you have a thousand percent return on a large sum maybe pull half of it out and put it into an S & P 500 index fund. You won’t make this mistake again", "author": "Chokedee-bp"}, {"text": "So you lost 4k and 21 years old.. I think you got the lesson early that do not invest where you do not have knowledge.. That is why we have ETFs for people who do not want to understand how stocks operates or stock market operates and live life and do your job or business and wait for couple of decades. Find some passions where you can work and make money and spend some time with other people..", "author": "vmskiran"}, {"text": "you can have my 400k and ill go back to being 19", "author": "roundhouseflick"}, {"text": "Stopped reading after the headline because I got all the info I needed. Drop the crypto, stick to Total Market Index Funds. That’s it.", "author": "o2msc"}, {"text": "All crypto is a scam. It isn’t real. You never should have made that much off it. Sure maybe you could have cashed out at the top if you timed it right but at the end of the day if you had that kind of discipline it would have never gotten to 400k. Any sensible person woulda cashed out at 6k or 8k. Eventually all cryptos will go to zero. Some just got lucky along the way", "author": "OppressionOlypian"}, {"text": "I wonder if this guy offed himself or something.", "author": "twitchsopamanxx"}, {"text": "I wasn’t going to originally comment here because I think it’s pretty obvious of what lessons were learned here and It was pointed out by previous comments. The one thing that I would add is that although this is a very hard thing to go through, it taught you a lot of lessons and showed you what money can do for you. Don’t be afraid to use this experience to make a difference in the world. Use this as motivation to go make that money in a legit sustainable way (not gambling and trying to find the next big hit). Then tell your story and motivate and help other people! You have a very unique opportunity here.", "author": "rfields_9", "children": [{"text": "Thanks for the words, i see it as that way aswell i got alot of lessons learned and i should in fact be thankful for these lessons even if its a very expensive lesson learned", "author": "Deadontheinside18"}]}, {"text": "Finishing school and learning a trade is the best thing you can do right now.", "author": "duke9350"}, {"text": "Check out options and puts! First one’s free", "author": "riverratcovid"}, {"text": "Since OP lost $400,000. Who has the money? The people who sold at a profit before the crash?", "author": "duke9350", "children": [{"text": "Yes. The people he bought the Luna from.", "author": "HotScale5"}]}, {"text": "heres a life lesson;\nez come\nez go", "author": "fadriansquest"}, {"text": "Time to swear off crypto and invest your money instead.", "author": "unbalancedcheckbook"}, {"text": "Old saying \"Never put all your eggs in one basket\"", "author": "EfficiencySafe"}, {"text": "Most of the very successful entrepreneurs you’ll meet in life have gone bankrupt AT LEAST once in their life. Get back up and keep hustling, your still a kid- a lot of time to make a lot more than 400k in your life", "author": "stocksNblondz"}, {"text": "At 19 you should be working a ton and educating yourself. Go try out some different jobs, meet interesting people, get in interesting conversations in interesting spaces. Grow your mind and your talents.\nYou learned an important lesson about gambling and how lucky to learn it as a kid and not as a parent with a family to look after.", "author": "Creepy-Floor-1745"}, {"text": "I actually lost about $40-45k for the same reason (was worth $120k at one point). I got over it eventually. It sucia but I’m glad I learned the lesson now.", "author": "AstronautFarmer112"}, {"text": "Good news. That $400k you lost was never real. So treat it that way.\nYou lost $4,000 and that’s not too bad. This lesson will mean you won’t make the same reckless investing decision when you have an inheritance. Or when you’ve earned 400k.\nLearned the hard way (but not the stupid way) about how to manage my money. You’re on a similar path.\nYou will recover.", "author": "Bleys007"}, {"text": "You got to travel the world on 4k investment while learning the most important lesson before the age of 20. Sorry you lost it, these things happen with volatile investments.", "author": "Competitive-Ad7847"}, {"text": "Honestly you’re still young. Most investments do not give you a 100x yield in a short time. While you can lament about it the reality is you learned an important lesson about speculative investing, risk, and the importance of diversification. Quite honestly, given what you were able to achieve even for a short time, you lost far less than you imagine.", "author": "LaOnionLaUnion"}, {"text": "So allow me to understand. You invested 4000 dollars and then withdrew 5000-6000 dollars a month from the investment and used it for travel.\nAnd you feel hopeless because of this? What real skills do you have to offer?", "author": "chanti1985", "children": [{"text": "I feel sad because i know it takes 20+ years to make that money back by working for the rest of my life", "author": "Deadontheinside18"}]}, {"text": "have you tried working at mcdonalds? start from fresh again and save up to invest again", "author": "tallguyyo"}, {"text": "get back in the fire and trade memecoins", "author": "Bryansherenow"}]